FormatSamples/structure_backup/Catalogs/ТелеграмСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТелеграмСервис</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСтатусыИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмВидыВходящихОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийТекстАвто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборыУсловийАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкиАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящийТекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмОбработка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FormatSamples/structure_backup/Catalogs/ТелеграмНаборУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
  <Catalog>
    <Properties>
      <Name>ТелеграмНаборУсловий</Name>
      <Hierarchical>true</Hierarchical>
      <HierarchyType>HierarchyFoldersAndItems</HierarchyType>
    </Properties>
    <ChildObjects>
      <Attribute>
        <Properties>
          <Name>КонтекстАвто</Name>
          <Type>
            <v8:Type>xs:decimal</v8:Type>
            <v8:NumberQualifiers>
              <v8:Digits>3</v8:Digits>
              <v8:FractionDigits>1</v8:FractionDigits>
            </v8:NumberQualifiers>
            <v8:Type>xs:boolean</v8:Type>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>УсловияАвто</Name>
          <Type>
            <v8:Type>xs:decimal</v8:Type>
            <v8:NumberQualifiers>
              <v8:Digits>2</v8:Digits>
              <v8:FractionDigits>1</v8:FractionDigits>
            </v8:NumberQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>ПрограммнаяПроверка</Name>
          <Type>
            <v8:Type>xs:boolean</v8:Type>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>КодПроверки</Name>
          <Type>
            <v8:Type>xs:string</v8:Type>
            <v8:StringQualifiers>
              <v8:Length>0</v8:Length>
            </v8:StringQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>Комментарий</Name>
          <Type>
            <v8:Type>xs:string</v8:Type>
            <v8:StringQualifiers>
              <v8:Length>0</v8:Length>
            </v8:StringQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <TabularSection>
        <Properties>
          <Name>Контекст</Name>
        </Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Параметр</Name>
              <Type>
                <v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>ВидСравнения</Name>
              <Type>
                <v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>Значение</Name>
              <Type>
                <v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыКонтекста</v8:TypeSet>
              </Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
      <TabularSection>
        <Properties>
          <Name>Условия</Name>
        </Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Параметр</Name>
              <Type>
                <v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыВходящегоСообщения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>ВидСравнения</Name>
              <Type>
                <v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>Значение</Name>
              <Type>
                <v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыВходящегоСообщения</v8:TypeSet>
              </Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
    </ChildObjects>
  </Catalog>
</MetaDataObject>

FormatSamples/structure_backup/Catalogs/ТелеграмСервис/Ext/ManagerModule.bsl
Функция ПолучитьСервисыДляВыполнения(НакопленныеДанные) Экспорт
	
	Перем ВидСравнения;
	
	Ответ = Новый Массив;
	
	Сообщение 					= НакопленныеДанные.Сообщение;
	ИдентификаторЧата 			= НакопленныеДанные.ИдентификаторЧата;
	ВидВходящегоОбновления 		= НакопленныеДанные.ВидВходящегоОбновления;
	
	Если ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.Сообщение Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаСравнения.Ссылка КАК Сервис,
		|	ТаблицаСравнения.Ссылка.Сортировка КАК Сортировка,
		|	ТаблицаСравнения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСравнения.ВидСравнения КАК ВидСравнения,
		|	ТаблицаСравнения.Значение КАК Значение
		|ИЗ
		|	Справочник.ТелеграмСервис.ВходящийТекст КАК ТаблицаСравнения
		|ГДЕ
		|	ТаблицаСравнения.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
		|	И ТаблицаСравнения.Ссылка.Бот = &Бот
		|	И ТаблицаСравнения.Ссылка.ВидВходящегоОбновления = &ВидВходящегоОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
		ЛевоеЗначение = НакопленныеДанные.ТекстСообщения;
		
	ИначеЕсли ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаСравнения.Ссылка КАК Сервис,
		|	ТаблицаСравнения.Ссылка.Сортировка КАК Сортировка,
		|	ТаблицаСравнения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСравнения.ВидСравнения КАК ВидСравнения,
		|	ТаблицаСравнения.Значение КАК Значение
		|ИЗ
		|	Справочник.ТелеграмСервис.ВходящиеДанные КАК ТаблицаСравнения
		|ГДЕ
		|	ТаблицаСравнения.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
		|	И ТаблицаСравнения.Ссылка.Бот = &Бот
		|	И ТаблицаСравнения.Ссылка.ВидВходящегоОбновления = &ВидВходящегоОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
		ЛевоеЗначение = НакопленныеДанные.ОтветКонтекстнойКлавиатуры;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", НакопленныеДанные.ДанныеБота.Бот);
	Запрос.УстановитьПараметр("ВидВходящегоОбновления", ВидВходящегоОбновления);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сервис 			= Выборка.Сервис;
		ВидСравнения 	= Выборка.ВидСравнения;
		ПравоеЗначение 	= Выборка.Значение;
		
		Если ТелеграмСервер.СравнениеИстинно(ЛевоеЗначение, ВидСравнения, ПравоеЗначение) Тогда
			Если Ответ.Найти(Сервис) = Неопределено Тогда
				Ответ.Добавить(Сервис);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Справочники.ТелеграмНаборУсловий.ОтфильтрованныеСервисы(Ответ, НакопленныеДанные);
	
	Возврат Ответ;
	
КонецФункции
